# IncludeWarningControls Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionSettings..::..IncludeWarningControls Property
StructuralConnectionSettings Class See Also
---
This property controls how Structural Connection Element is generated. If set to true and warnings are reported for given Element, additional yellow triangle is displayed.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool IncludeWarningControls { get; set; }
```

Visual Basic
---
```text
Public Property IncludeWarningControls As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IncludeWarningControls {
	bool get ();
	void set (bool value);
}
```

# See Also
StructuralConnectionSettings Class
Autodesk.Revit.DB.Structure Namespace